Repository: Diskette-Guy/kde-l10n-th
Catalog: messages/kcoreaddons/kde6_xml_mimetypes.po
Languages: th

# comment
source: CD audio
th: แผ่นซีดีเสียง

# comment
source: SNF bitmap font
th: แบบอักษรบิตแมป SNF

# comment
source: Java applet
th: แอพเพล็ต Java

# comment
source: KDE color scheme
th: ชุดสีของ KDE

# comment
source: KNewStuff package
th: แพกเกจ KNewStuff

# comment
source: KWallet wallet
th: กระเป๋าของ KWallet

# comment
source: SuperKaramba theme
th: ธีมของ SuperKaramba

# comment
source: Calligra Plan project management document
th: Calligra Plan เอกสารจัดการงาน

# comment
source: Calligra Plan work package document
th: Calligra Plan เอกสารชุดงาน

# comment
source: KPlato project management document
th: KPlato เอกสารจัดการงาน

# comment
source: KPlato project management work package
th: KPlato ชุดจัดการงานงาน

# comment
source: Kugar archive
th: แฟ้มจัดเก็บ Kugar

# comment
source: web archive
th: แฟ้มจัดเก็บของหน้าเว็บ

# comment
source: KPhotoAlbum import
th: นําเข้า KPhotoAlbum

# comment
source: HDR image
th: ภาพแบบ HDR

# comment
source: KDE raw image formats
th: รูปแบบ KDE raw image

# comment
source: Intel® hexadecimal object file
th: ไฟล์ออบเจ็กต์ฐานสิบหกของ Intel®

# comment
source: Kate file list loader plugin list
th: รายการปลั้กอินโหลดรายการไฟล์ Kate

# comment
source: abc musical notation file
th: ไฟล์โน้ตดนตรี abc

# comment
source: fonts package
th: ชุดแบบอักษร

# comment
source: KDE system monitor
th: การตรวจสอบระบบ KDE

# comment
source: KDE theme
th: ธีม KDE

# comment
source: Quanta project
th: โครงงาน Quanta

# comment
source: Kommander file
th: ไฟล์ Kommander

# comment
source: Kolf saved game
th: ข้อมูลที่บันทึกไว้ของเกม Kolf

# comment
source: Kolf course
th: คอร์สของเกม Kolf

# comment
source: Okular document archive
th: แฟ้มจัดเก็บเอกสารของ Okular

# comment
source: Cabri figure
th: รูป Cabri

# comment
source: Dr. Geo figure
th: รูป Dr.Geo

# comment
source: KGeo figure
th: รูป KGeo

# comment
source: Kig figure
th: รูป Kig

# comment
source: KSeg document
th: เอกสาร RDF/XML

# comment
source: vocabulary trainer document
th: เอกสารฝึกคําศัพท์

# comment
source: KmPlot file
th: ไฟล์ KmPlot

# comment
source: KWordQuiz vocabulary
th: คําศัพท์ KWordQuiz

# comment
source: Cachegrind/Callgrind profile dump
th: โปรไฟล์ Cachegrind/Callgrind

# comment
source: Umbrello UML Modeller file
th: ไฟล์ Umbrello UML Modeller

# comment
source: Windows link
th: ลิงค์ของ Windows

# comment
source: KGet download list
th: รายการดาวน์โหลดของ KGet

# comment
source: Kopete emoticons archive
th: ไฟล์เก็บอิโมติคอน Kopete

# comment
source: ICQ contact
th: ที่ติดต่อ ICQ

# comment
source: Turtle RDF document
th: เอกสาร RDF/XML

# comment
source: Softimage PIC image
th: ภาพ Softimage PIC

# comment
source: KConfigXT Configuration Options
th: ตัวเลือกปรับแต่ง KConfigXT

# comment
source: KConfigXT Code Generation Options
th: ตัวเลือกสร้างโค้ด KConfigXT

# comment
source: KXMLGUI UI Declaration
th: คําประกาศ KXMLGUI UI

# comment
source: KNotification Declaration
th: คําประกาศ KNotification

# comment
source: KCrash Report
th: รายงาน KCrash
