Repository: Diskette-Guy/kde-l10n-th
Catalog: messages/konqueror/konqueror._desktop_.po
Languages: th

# GenericName
source: Web Browser
th: เว็บเบราว์เซอร์

# Name
source: Bookmark Toolbar
th: แถบเครื่องมือที่คั่นหน้า

# Comment
source: KDE File Manager & Web Browser
th: จัดการแฟ้ม & เว็บเบราว์เซอร์ของ KDE

# Name
source: File Size Viewer
th: เครื่องมือดูขนาดแฟ้ม

# Comment
source: View your filesystem as a TreeMap
th: แสดงระบบแฟ้มของคุณแบบผังต้นไม้

# X-KDE-Submenu
source: Convert To
th: แปลงเป็น

# Name
source: JPEG
th: แฟ้มภาพประเภท JPEG

# Name
source: PNG
th: แฟ้มภาพประเภท PNG

# Name
source: TIFF
th: แฟ้มภาพประเภท TIF

# Name
source: GIF
th: แฟ้มภาพประเภท GIF

# X-KDE-Submenu
source: Transform Image
th: แปลงรูปภาพ

# Name
source: Rotate Clockwise
th: หมุนตามเข็มนาฬิกา

# Name
source: Rotate Counter-Clockwise
th: หมุนทวนเข็มนาฬิกา

# Name
source: Flip Vertically
th: พลิกกลับทางแนวตั้ง

# Name
source: Flip Horizontally
th: พลิกกลับทางแนวนอน

# Name
source: Stylesheets
th: สไตล์ชีต

# Comment
source: Configure the stylesheets used to render web pages
th: ปรับแต่งสไตล์ชีตที่ใช้ในการแสดงผล HTML

# Name
source: Performance
th: ประสิทธิภาพ

# Comment
source: Configure settings that can improve Konqueror performance
th: ปรับแต่งตั้งค่าที่จะช่วยให้ Konqueror มีประสิทธิภาพดีขึ้น

# Name
source: Bookmarks
th: ที่คั่นหน้า

# Comment
source: This is the list of your bookmarks, for a faster access
th: นี่เป็นรายการที่คั่นหน้าของคุณเพื่อการเรียกใช้งานได้อย่างรวดเร็ว

# Name
source: Fonts
th: แบบอักษรต่างๆ

# Name
source: History
th: ประวัติการใช้

# Comment
source: This is the history of the URLs you have recently visited. You can sort them in many ways.
th: นี่เป็นประวัติเก็บที่อยู่ URL ที่คุณเคยเรียกใช้มาก่อน โดยคุณสามารถเรียงลำดับมันได้ในหลายรูปแบบ

# Name
source: Home Folder
th: โฟลเดอร์ส่วนตัว

# Comment
source: This folder contains your personal files
th: โฟลเดอร์นี้บรรจุแฟ้มส่วนตัวต่าง ๆ ของคุณ

# Name
source: Places
th: ที่หลัก ๆ

# Comment
source: This is the list of places.
th: นี่เป็นรายการของที่หลัก ๆ

# Name
source: Root Folder
th: โฟลเดอร์ราก

# Comment
source: This is the root of the filesystem
th: นี่เป็นรากของระบบแฟ้ม

# Name
source: Services
th: บริการต่าง ๆ

# Name
source: Folder
th: โฟลเดอร์

# Name
source: Network
th: เครือข่าย

# Name
source: FTP Archives
th: แฟ้มจัดเก็บบนบริการ FTP

# Name
source: KDE Official FTP
th: บริการ FTP อย่างเป็นทางการของ KDE

# Name
source: Web Sites
th: เว็บไซต์

# Name
source: KDE Applications
th: โปรแกรมต่าง ๆ ของ KDE

# Name
source: KDE News
th: ข่าวของ KDE

# Name
source: KDE Home Page
th: หน้าเว็บโครงการ KDE

# Name
source: KDE Eye Candy
th: ตกแต่งลูกเล่นของ KDE

# Name
source: Applications
th: โปรแกรมต่าง ๆ

# Name
source: Print System Browser
th: โปรแกรมเรียกดูระบบการพิมพ์

# Name
source: Web SideBar Module
th: มอดูลแถบข้างสำหรับเว็บ

# Name
source: About-Page for Konqueror
th: หน้าเกี่ยวกับ Konqueror
