Repository: Diskette-Guy/kde-l10n-th
Catalog: messages/plasma-desktop/kcm_recentFiles.po
Languages: th

source: How many months keep the activity history
th: เก็บประวัติกิจกรรมไว้กี่เดือน

source: Which data to keep in activity history
th: ข้อมูลใดที่จะเก็บไว้ในนะประวัติกิจกรรม

source: List of Applications whose activity history to save
th: รายการแอปพลิเคชันที่จะบันทึกประวัติไว้

source: List of Applications whose activity history not to save
th: รายการแอปพลิเคชันที่จะไม่บันทึกประวัติไว้

# unlimited number of months
source: Forever
th: ตลอดไป

source: Forget the last hour
th: ทิ้งประวัติหนึ่งชั่วโมงที่แล้ว

source: Forget the last two hours
th: ทิ้งประวัติสองชั่วโมงที่แล้ว

source: Forget a day
th: ทิ้งประวัติวันที่แล้ว

source: Forget everything
th: ทิ้งประวัติทุกอย่าง

# unit of time. months to keep the history
source: month
th: เดือน

# for in 'keep history for 5 months'
source: For
th: เป็น

source: Cleared the activity history.
th: ล้างประวัติกิจกรรมสำเร็จ

source: Keep history:
th: เก็บประวัติ:

source: Clear History
th: ล้างประวัติ:

source: For a&ll applications
th: &เป็นแอปพลิเคชันทั้งหมด

source: &Do not remember
th: &ไม่จำ

source: O&nly for specific applications:
th: &สำหรับแอปพลิเคชันบางตัวเท่านั้น:

source: Remember opened documents:
th: จำเอกสารที่เปิดไว้:

source: Exclude applications not on the list
th: เว้นแอปพลิเคชันที่ไม่ได้อยู่ในรายการ

source: Blacklist applications not on the list
th: กั้นแอปพลิเคชันที่ไม่ได้อยู่ในรายการ
