Repository: Diskette-Guy/kde-l10n-th
Catalog: messages/plasma-desktop/kcm_smserver.po
Languages: th

source: Confirm logout
th: ยืนยันการออกจากระบบ

source: Default leave option
th: ตัวเลือกการออก

source: On login
th: เมื่อตอนล็อกอิน

source: Applications to be excluded from session
th: แอปพลิเคชันที่ถูกยกเว้นจากเซสชัน

source: Failed to request restart to firmware setup: %1
th: การรีสตาร์ตเพื่อการอัพเดตเฟิร์มแวร์ล้มเหลว: %1

source: The system must be restarted before manual session saving becomes active.
th: ระบบต้องถูกรีสตาร์ตก่อนที่การบันทึกเซสชันด้วยตนเองจะทำงาน

source: Next time the computer is restarted, it will enter the UEFI setup screen.
th: ครั้งต่อไปที่คอมพิวเตอร์ถูกรีสตาร์ต ระบบจะเข้าสู่หน้าการตั้งค่า UEFI

source: Next time the computer is restarted, it will enter the firmware setup screen.
th: ครั้งต่อไปที่คอมพิวเตอร์ถูกรีสตาร์ต ระบบจะเข้าสู่หน้าการตั้งค่าเฟิร์มแวร์

source: Restart Now
th: รีสตาร์ตตอนนี้

source: Restart
th: รีสตาร์ต

# @title:group
source: General
th: ทั่วไป

source: Ask for confirmation:
th: ถามยืนยันก่อน:

source: On shutdown, restart, and logout
th: ตอนปิดเครื่อง รีสตาร์ต และ ออกจากระบบ

# @title:group
source: Session Restore
th: คืนค่าเซสชัน

source: On login, launch apps that were open:
th: เปิดแอปที่เคยเปิดขึ้นมาก่อนเมื่อล็อกอิน:

# @option:radio Automatic style of session restoration
source: On last logout
th: ตอนออกจากระบบครั้งสุดท้าย

source: Show:
th: แสดง:

# @option:radio Manual style of session restoration
source: When session was manually saved
th: เมื่อตอนที่เซสชันถูกบันทึก

# @info
source: A <interface>Save Session</interface> button will appear in the <interface>Application Launcher</interface> menu. When you click it, Plasma will remember the apps that are open and restore them on the next login. Click it again to replace the set of remembered apps.
th: ปุ่ม<interface>บันทึกเซสชัน</interface>จะโผล่ขึ้นมาในเมนู<interface>ตัวเปิดแอปพลิเคชัน</interface>เมื่อถูกกด Plasma จะจำแอปที่เปิดไว้อยู่ปัจจุบัน และเปิดแอปพวกนั้นตอนล็อกอินเข้ามาใหม่ กดอีกรอบหนึ่งเพื่อเป็นการเปลี่ยนรายการแอปพลิเคชันที่จะจำ

# @info
source: When this setting is turned on, the logout confirmation screen will be shown when you log out, shut down, restart, press the power button, or click on buttons or menu items labeled <interface>Leave…</interface>.
th: เมื่อการตั้งค่านี้ถูกเปิดใช้งาน หน้ายืนยันการออกจากระบบจะแสดงขึ้นมาเมื่อคถณออกจากระบบ ปิดเครื่อง รีสตาร์ต กดปุ่มเปิด หรือกดปุ่มหรือเมนูที่ระบุ<interface>ออกจาก...</interface>

source: Start with an empty session
th: เริ่มทำงานโดยใช้เซสชันที่ว่างเปล่า

source: Ignored applications:
th: แอปพลิเคชันที่เพิกเฉย:

source: Write apps' desktop file identifier or, on X11, executable names here (separated by commas or colons, for example 'xterm:org.kde.konsole.desktop' or 'xterm,org.kde.konsole.desktop') to prevent them from autostarting along with other session-restored apps.
th: เขียน desktop file identifier ของแอปนั้น ๆ หรือ ถ้าหากอยู่บน X11 ชื่อไฟล์ executable ที่นี่ (ที่ถูกแยกโดยใช้เครื่องหมายจุลภาคหรือทวิภาค เช่น 'xterm:org.kde.konsole.desktop' หรือ 'xterm,org.kde.konsole.desktop') เพื่อกันไม่ให้แอปพวกนั้นเริ่มทำงานโดยอัตโนมัติพร้อมกับแอปที่ถูกคืนค่า

source: Write apps' executable names here (separated by commas or colons, for example 'xterm:konsole' or 'xterm,konsole') to prevent them from autostarting along with other session-restored apps.
th: เขียนชื่อไฟล์ executable ของแอปที่นี่ (ที่ถูกแยกโดยใช้เครื่องหมายจุลภาคหรือทวิภาค เช่น 'xterm:konsole' หรือ 'xterm,konsole') เพื่อกันไม่ให้แอปพวกนั้นเริ่มทำงานโดยอัตโนมัติพร้อมกับแอปที่ถูกคืนค่า

# @title:group
source: Firmware
th: เฟิร์มแวร์

# @title:group
source: Logout Screen
th: หน้าจอออกจากระบบ

source: After next restart:
th: หลังจากการรีสตาร์ตครั้งต่อไป:

# @option:check
source: Enter UEFI setup screen
th: เข้าหน้าการตั้งค่า UEFI

# @option:check
source: Enter firmware setup screen
th: เข้าหน้าการตั้งค่าเฟิร์มแวร์

source: <h1>Session Manager</h1> You can configure the session manager here. This includes options such as whether or not the session exit (logout) should be confirmed, whether the session should be restored again when logging in and whether the computer should be automatically shut down after session exit by default.
th: <h1>ตัวจัดการเซสชัน</h1> คุณสามารถปรับแต่งตัวจัดการเซสชันได้ที่นี่ ทั้งการแสดงกล่องยืนยันการออกจากระบบ และเรียกคืนเซสชันเดิมที่ทำงานค้างไว้ เมื่อล็อกอินเข้าระบบครั้งต่อไป
