Repository: Diskette-Guy/kde-l10n-th
Catalog: messages/plasma-desktop/kcm_tablet.po
Languages: th

# @action:button This action is disabled
source: Disabled
th: ปิดการใช้งาน

# @action:button There is no keybinding
source: None
th: ไม่มี

# @action:button
source: Left mouse button
th: ปุ่มเมาส์ซ้าย

# @action:button
source: Right mouse button
th: ปุ่มเมาส์ขวา

# @action:button
source: Middle mouse button
th: ปุ่มเมาส์กลาง

# @action:button
source: Application-defined
th: เฉพาะแอปพลิเคชันที่กำหนด

# @action:button
source: Pen Button %1
th: ปุ่มปากกา %1

source: Primary (default)
th: หลัก (ค่าเริ่มต้น)

source: Default
th: ค่าเริ่มต้น

source: Portrait
th: แนวตั้ง

source: Landscape
th: แนวนอน

source: Inverted Portrait
th: แนวตั้งกลับหัว

source: Inverted Landscape
th: แนวนอนกลับหาง

source: Follow the Current Screen
th: ตามหน้าจอปัจจุบัน

source: Follow the active screen
th: ตามหน้าจอที่ใช้งานอยู่

source: All Screens
th: หน้าจอทั้งหมด

source: Fit to Output
th: ทำให้พอดีกับเอาต์พุต

source: Fit Output in tablet
th: ทำให้พอดีกับเอาต์พุตในโหมดแท็ปเล็ต

source: Custom size
th: กำหนดขนาดเอง

# @item:inlistbox Stretch and fill to the screen
source: Stretch and Fill
th: ยืดหน้าจอและทำให้เต็ม

# @item:inlistbox Keep aspect ratio and fit within the screen
source: Keep Aspect Ratio and Fit
th: ใช้อัตราส่วนภาพดั่งเดิมและทำให้เต็ม

# @item:inlistbox Map to portion of the screen
source: Map to Portion
th: ตั้งจุดไปเป็นส่วน

# Stylus pen button
source: Pen button %1:
th: ปุ่มปากกา %1:

source: pen button %1
th: ปุ่มปากกา %1:

# @title Select the action for the tablet button
source: Select Button Action
th: เลือกการกระทำของปุ่ม

# @info %1 is the 'pad button %1' or 'pen button 1/2/3' strings
source: Choose what action will be taken when pressing %1:
th: เลือกการกระทำที่จะถูกใช้งานเมื่อกด %1:

# @option:radio Set this action to an application-defined type
source: Defer to application
th: ยกเว้นแอปพลิเคชัน

# @option:radio Set this action to a keyboard type
source: Send keyboard key
th: กดปุ่มแป้นพิมพ์

# @option:radio Set this action to a mouse type
source: Send mouse button click
th: กดปุ่มเมาส์

# @option:radio Set this action to a pen button type
source: Send pen button
th: กดปุ่มปากกา

# @option:radio Disable this action
source: Do nothing
th: ไม่ต้องทำอะไร

# @info
source: This tablet button is forwarded to the focused application, which can decide how to handle it.
th: ปุ่มแท็ปเล็ตนี้จะถูกใช้งานในแอปพลิเคชันที่ใช้งานอยู่ ซึ่งตัวแอปจะเป็นคนตัดสินใจเองว่าปุ่มทำงานอย่างไร

# @action:inmenu Left mouse click
source: Left-click
th: คลิกเมาส์ซ้าย

# @action:inmenu Middle mouse click
source: Middle-click
th: คลิกเมาส์กลาง

# @action:inmenu Right mouse click
source: Right-click
th: คลิกเมาส์ขวา

# @action:inmenu Stylus button
source: Button 1
th: ปุ่ม 1

# @action:inmenu Stylus button
source: Button 2
th: ปุ่ม 2

# @action:inmenu Stylus button
source: Button 3
th: ปุ่ม 3

# @info
source: This button is disabled and will not do anything.
th: ปุ่มนี้จะถูกปิดการใช้งานและจะไม่ทำอะไร

# @title
source: Pen Calibration
th: การปรับเทียบปากกา

# @info
source: Calibration is completed and saved.<nl/><nl/>Refine the calibration further or close the window.
th: การปรับเทียบได้สำเร็จและได้ถูกบันทึกแล้ว<nl/><nl/>ปรับปรุงการปรับเทียบเพิ่มเติมหรือปิดหน้าต่างนี้

# @info
source: Tap the center of each target.<nl/><nl/>Aim for the point where the stylus tip lands, and ignore the cursor position on the screen.
th: กดตรงกลางจุดเป้าหมาย<nl/><nl/>เล็งที่หัวปากกา และอย่าไปสนใจตำแหน่งของตัวชี้บนหน้าจอ

# @action:button
source: Refine Existing Calibration
th: ปรับปรุงการปรับเทียบเพิ่มเติม

# @action:button
source: Calibrate from Scratch
th: ปรับเทียบใหม่

# @action:button
source: Close
th: ปิด

# @action:button
source: Cancel
th: ยกเลิก

source: Map to screen:
th: ตั่งค่าไปยังหน้าจอ:

source: Orientation:
th: ทิศทาง:

source: Not Applicable
th: ไม่สามารถใช้งานได้

source: Mapped Area:
th: พื้นที่กำหนดไว้:

# @option:check
source: Lock aspect ratio
th: ล็อคสัดส่วนหน้าจอ

source: Resize the screen area
th: ปรับขนาดพื้นที่หน้าจอ

source: Resize the tablet area
th: ปรับขนาดพื้นที่แท็ปเล็ต

source: No drawing tablets found
th: ไม่พบเจอแท็ปเล็ต

source: Connect a drawing tablet
th: เชื่อมต่อแท็ปเล็ต

# Tests tablet functionality like the pen
source: Test Tablet…
th: ทดสอบแท็ปเล็ต…

# @label:listbox The device we are configuring
source: Device:
th: อุปกรณ์:

# @title:tab
source: Display
th: แสดงผล

# @title:tab
source: Pen
th: ปากกา

# @title:tab
source: Pad
th: พื้นที่

source: Pad button %1:
th: ปุ่ม %1:

source: pad button %1
th: ปุ่ม %1:

source: Left-handed mode:
th: โหมดมือซ้าย

# Enable left-handed mode
source: Enable
th: เปิดใช้งาน

# @info
source: Tells the device to accommodate left-handed users. Effects will vary by device, but often it reverses the pad buttonsʼ functionality so the tablet can be used upside-down.
th: เป็นการบอกให้อุปกรณ์ใช้โหมดมือซ้าย ซึ่งผลลัพท์แตกต่างกันอยู่แล้วในแต่ละอุปกรณ์ แต่ส่วนมากแล้วจะเป็นการกลับหัวปุ่มบนพื้นที่วาดให้สามารถใช้งานกลับหัวได้

source: Pen Pressure:
th: แรงกดปากกา:

# @info
source: This curve controls the relationship between the pressure on the stylus and the pressure values received by applications.
th: โค้งนี้ควบคุมความสัมพันธ์ระหว่างแรงกดบนหัวปากกาและค่าแรงกดที่แอปพลิเคชันได้รับ

# Pen pressure range
source: Pressure Range:
th: ระยะแรงกด:

# @info
source: Pressure above or below the threshold will be clamped, and this becomes the new effective range.
th: ระยะแรงกดที่มากกว่าหรือน้อยกว่าขีดจำกัดจะถูกปัดเศษ และกลายเป็นค่าที่สามารถใช้งานได้

# @action:button Calibration in progress
source: Calibration in Progress
th: กำลังปรับเทียบอยู่

# @action:button Calibrate the pen display
source: Calibrate
th: ปรับเทียบ

# @action:button Pen display doesn't support calibration
source: Calibration Not Supported
th: ไม่รับรองการปรับเทียบ

# @title
source: Tablet Tester
th: ทดสอบแท็ปเล็ต

source: Stylus press X=%1 Y=%2
th: ปากกาได้กดแกน X=%1 Y=%2

source: Stylus release X=%1 Y=%2
th: ปากกาได้ปล่อยแกน X=%1 Y=%2

source: Stylus move X=%1 Y=%2 P=%3% TX=%4 TY=%5
th: ปากกาได้ขยับแกน X=%1 Y=%2 P=%3% TX=%4 TY=%5

source: ## Legend: # X, Y - event coordinate # P - pressure # TX,TY - tilt
th: ## ค่าต่าง ๆ : # X, Y - ตำแหน่ง # P - แรงกด # TX,TY - การเอียง

# Clear the event log
source: Clear
th: ล้าง

source: No drawing tablets found.
th: ไม่พบเจอแท็ปเล็ต.

source: Target display:
th: ใช้หน้าจอแสดงผล:

source: Area:
th: พื้นที่:

source: Tool Button 1
th: ปุ่มเครื่องมือ 1

source: Tool Button 2
th: ปุ่มเครื่องมือ 2

source: Tool Button 3
th: ปุ่มเครื่องมือ 3

# @label:listbox The pad we are configuring
source: Pad:
th: พื้นที่วาด:

source: None
th: ไม่มี

source: Button %1:
th: ปุ่ม %1:
