Repository: Diskette-Guy/kde-l10n-th
Catalog: messages/plasma-desktop/kcm_splashscreen.po
Languages: th

source: None
th: ไม่มี

source: No splash screen will be shown
th: หน้าจอสแปลชจะไม่ถูกแสดง

source: You cannot delete the currently selected splash screen
th: คุณไม่สามารถลบหน้าจอสแปลชที่ถูกเลือกอยู่ปัจจุบันได้

source: For future use
th: สำหรับการใช้งานในอนาคต

source: Name of the current splash theme
th: ชื่อของธีมหน้าจอสแปลชปัจจุบัน

source: &Get New…
th: &รับใหม่...

source: Failed to show the splash screen preview.
th: การแสดงตัวอย่างหน้าจอสแปลชล้มเหลว

source: This module lets you choose the splash screen theme.
th: มอดูลนี้เลือกธีมหน้าจอสแปลชที่จะใช้ได้

source: Preview Splash Screen
th: แสดงตัวอย่างหน้าจอสแปลช

source: Uninstall
th: ถอนการติดตั้ง
