Repository: Diskette-Guy/kde-l10n-th
Catalog: messages/khelpcenter/khelpcenter._desktop_.po
Languages: th

# Name
source: KHelpCenter
th: ศูนย์ช่วยเหลือ-K

# Name
source: Application Manuals
th: คู่มือของโปรแกรมต่าง ๆ

# Name
source: Browse Info Pages
th: เรียกดูหน้าข้อมูล (info)

# Name
source: KInfoCenter Modules
th: มอดูลของศูนย์ข้อมูล

# Name
source: UNIX manual pages
th: หน้าคู่มือ UNIX

# Name
source: (1) User Commands
th: (1) คำสั่งต่าง ๆ ของผู้ใช้

# Name
source: (2) System Calls
th: (2) คำสั่งต่าง ๆ ของระบบ

# Name
source: (3) Subroutines
th: (3) รูทีนย่อยต่าง ๆ

# Name
source: (4) Devices
th: (4) อุปกรณ์ต่าง ๆ

# Name
source: (5) File Formats
th: (5) รูปแบบแฟ้มต่าง ๆ

# Name
source: (6) Games
th: (6) เกมต่าง ๆ

# Name
source: (7) Miscellaneous
th: (7) เบ็ดเตล็ด

# Name
source: (8) Sys. Administration
th: (8) ผู้ดูแลระบบ

# Name
source: (9) Kernel
th: (9) เคอร์เนล

# Name
source: (n) New
th: (n) หมวดใหม่

# Name
source: Online Help
th: ความช่วยเหลือออนไลน์

# Name
source: Plasma Manual
th: คู่มือของพลาสมา
