Repository: Diskette-Guy/kde-l10n-th
Catalog: messages/k3b/k3b._json_.po
Languages: th

# Name
source: K3b FFMpeg Decoder
th: K3b - ตัวถอดรหัส FFMpeg

# Name
source: K3b FLAC Decoder
th: K3b - ตัวถอดรหัส FLAC

# Description
source: Decoding module to decode FLAC files
th: มอดูลถอดรหัสแฟ้มประเภท FLAC

# Name
source: K3b Libsndfile Decoder
th: K3b - ตัวถอดรหัส Libsndfile

# Description
source: Decoding module to decode audio files supported by libsndfile
th: มอดูลถอดรหัสแฟ้มเสียงต่าง ๆ ที่ libsndfile รองรับ

# Name
source: K3b MAD Decoder
th: K3b - ตัวถอดรหัส MAD

# Description
source: Decoding module to decode MPEG 1 Layer III files
th: มอดูลถอดรหัสแฟ้มประเภท MPEG 1 เลเยอร์ 3

# Name
source: K3b Musepack Decoder
th: K3b - ตัวถอดรหัส Musepack

# Description
source: Decoding module to decode Musepack audio files
th: มอดูลถอดรหัสแฟ้มเสียงต่าง ๆ ของ Musepack

# Name
source: K3b Ogg Vorbis Decoder
th: K3b - ตัวถอดรหัส Ogg Vorbis

# Description
source: Decoding module to decode Ogg Vorbis files
th: มอดูลถอดรหัสแฟ้มประเภท Ogg Vorbis

# Name
source: K3b ??? Decoder
th: K3b - ตัวถอดรหัส ???

# Description
source: Decoding module to decode ??? files
th: มอดูลถอดรหัสแฟ้มประเภท ???

# Name
source: K3b Wave Decoder
th: K3b - ตัวถอดรหัส Wave

# Description
source: Decoding module to decode wave files
th: มอดูลถอดรหัสแฟ้มประเภท wave

# Name
source: K3b External Audio Encoder
th: K3b - ตัวเข้ารหัสเสียงภายนอก

# Description
source: Encoding module that allows specifying an encoding command
th: มอดูลเข้ารหัสเสียงที่อนุญาตให้มีการระบุคำสั่งในการเข้ารหัส

# Name
source: K3b Ogg Vorbis Encoder
th: K3b - ตัวเข้ารหัส Ogg Vorbis

# Description
source: Encoding module to encode Ogg Vorbis files
th: มอดูลเข้ารหัสแฟ้มประเภท Ogg Vorbis

# Name
source: K3b ??? Encoder
th: K3b - ตัวเข้ารหัส ???

# Description
source: Encoding module to encode <name> files
th: มอดูลเข้ารหัสแฟ้มประเภท <name>

# Name
source: K3b SoX Audio Encoder
th: K3b - ตัวเข้ารหัสเสียง SoX

# Description
source: Encoding module to encode many file formats using SoX
th: มอดูลเข้ารหัสแฟ้มหลายรูปแบบโดยใช้ SoX

# Name
source: K3b Audio Metainfo Renamer
th: K3b - เครื่องมือเปลี่ยนชื่อของข้อมูลกำกับ

# Description
source: Plugin to rename audio files in a data project based on the meta info.
th: ส่วนเสริมสำหรับการเปลี่ยนชื่อแฟ้มเสียงต่าง ๆ ในโครงงานข้อมูลที่มีการใช้งานข้อมูลกำกับร่วมด้วย
