Repository: Diskette-Guy/kde-l10n-th
Catalog: messages/wacomtablet/wacomtablet._desktop_.po
Languages: th

# Comment
source: Wacom Tablet
th: แท็บเล็ตของ Wacom

# Name
source: WacomTablet
th: แท็บเล็ตของ Wacom

# Name
source: New tablet connected
th: เชื่อมต่อแท็บเล็ตใหม่แล้ว

# Comment
source: New graphic tablet connected
th: เชื่อมต่อแท็บเล็ตกราฟิกใหม่แล้ว

# Name
source: Tablet removed
th: เอาแท็บเล็ตออกแล้ว

# Comment
source: Graphic tablet removed
th: เอาแท็บเล็ตกราฟิกออกแล้ว

# Name
source: A tablet error
th: แท็บเล็ตมีข้อผิดพลาด

# Comment
source: An error occurred with the tablet
th: เกิดข้อผิดพลาดกับแท็บเล็ต

# Name
source: Wacom Tablet Settings
th: การตั้งค่าแท็บเล็ตของ Wacom

# Comment
source: Hotplugging and profile support for Wacom tablets
th: การสนับสนุนโพรไฟล์และการเสียบและถอดสำหรับ tablet ของ Wacom

# Name
source: Graphic Tablet
th: แท็บเล็ตกราฟิก

# Comment
source: Wacom Tablet Settings
th: การตั้งค่าแท็บเล็ตของ Wacom

# Name
source: Wacom Tablet
th: แท็บเล็ตของ Wacom

# Comment
source: Wacom tablet control daemon
th: ดีมอนควบคุมแท็บเล็ตของ Wacom
