Repository: Diskette-Guy/kde-l10n-th
Catalog: messages/kget/kget._desktop_.po
Languages: th

# Name
source: Download with KGet
th: ดาวน์โหลดด้วย 'ดาวน์โหลด-K'

# Name
source: KGet
th: ดาวน์โหลด-K

# GenericName
source: Download Manager
th: เครื่องมือจัดการการดาวน์โหลด

# Comment
source: KGet Download Manager
th: เครื่องมือจัดการการดาวน์โหลด (KGet)

# Comment
source: A new download has been added
th: เพิ่มการดาวน์โหลดรายการใหม่แล้ว

# Name
source: Download Started
th: เริ่มทำการดาวน์โหลดแล้ว

# Comment
source: Downloading started
th: การดาวน์โหลดเริ่มแล้ว

# Name
source: Download Finished
th: ดาวน์โหลดเสร็จสิ้นแล้ว

# Comment
source: Downloading finished
th: การดาวน์โหลดเสร็จสิ้นแล้ว

# Name
source: All Downloads Finished
th: การดาวน์โหลดทั้งหมดเสร็จสิ้นแล้ว

# Comment
source: All downloads finished
th: การดาวน์โหลดทั้งหมดเสร็จสิ้นแล้ว

# Name
source: Error Occurred
th: เกิดข้อผิดพลาดขึ้น

# Comment
source: An Error has Occurred
th: เกิดข้อผิดพลาดขึ้น

# Name
source: Information
th: ข้อมูลรายละเอียด
